package customClass;

//В этом классе должно быть минимум три поля и по каждому должна выполняться сортировка.
//Так как четких требований нет, предлагаю сделать поля типов String, double и int
//Так же для CustomClass в папке test создать "тестовый" класс в котором проверять сортировку полей + валидацию
public class CustomClass {
    //TODO реализовать паттерн Builder + добавить валидацию данных
    //TODO валидация данных, как я понимаю, это как минимум проверка на то что переданные данные сортируемы (не boolean, Strings не содержат символов)
}
